# Getting Started with Pandas and Scikit-learn

This ipython notebook is a guide to use pandas DataFrame instead of Graphlab SFrame for the techniques mentioned in the machine learning course using GraphLab Create.

In [1]:
import pandas

In [8]:
df = pandas.read_csv('people-example.csv') # read_csv automatically reads the data into a DataFrame

In [10]:
df # Display first few lines of the dataframe

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [11]:
df.head() # Display first five lines

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.tail() # Display last five lines

  First Name Last Name        Country  age
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [18]:
df['age']

0    24
1    23
2    22
3    23
4    23
5    22
6    25
Name: age, dtype: int64

In [19]:
df['age'].mean()

23.142857142857142

In [20]:
df['age'].max()

25

## Create new columns in DataFrame

In [21]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [22]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [23]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [25]:
df['age'] + 2 # Arithmetic operations on columns

0    26
1    25
2    24
3    25
4    25
5    24
6    27
Name: age, dtype: int64

In [26]:
df['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [27]:
def transform_country(country):
    if country == "USA":
        return 'United States'
    else:
        return country

In [28]:
transform_country('Brazil')

'Brazil'

In [29]:
transform_country('USA')

'United States'

In [30]:
df['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [31]:
df['Country'] = df['Country'].apply(transform_country)

In [32]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward